import { useState } from 'react';
import { AccordionItem } from '../AccordionItem';
import './Accordion.scss';

const sections = [
  {
    title: 'Network',
    text: [
      'Розробка мережевої архітектури', 
      'Управління трафіком і пропускною спроможністю',
      'Впровадження IPv6',
      'Віртуалізація мережі (SDN)',
      'Забезпечення високої доступності',
      'Моніторинг мережевої інфраструктури'
    ]
  },
  {
    title: 'Security',
    text: [
      'Кібербезпека', 
      'Шифрування даних',
      'Захист від DDoS-атак',
      'Безпека хмарних сервісів',
      'Рішення для захисту кінцевих точок (Endpoint Security)',
      'Ідентифікація та управління доступом'
    ]
  },
  {
    title: 'Unified Communication',
    text: [
      'Відеоконференції та телеприсутність', 
      'Інтеграція з електронною поштою та календарем',
      'Мобільні рішення',
      'Системи голосових повідомлень',
      'Колаборативні платформи',
      'Організація віртуальних робочих місць'
    ]
  },
  {
    title: 'Wireless',
    text: [
      'Wi-Fi мережі', 
      'Радіорозвідка',
      'Внутрішнє покриття (In-building Solutions)',
      'Безпечність бездротових мереж',
      'Менеджмент мобільних пристроїв (MDM)'
    ]
  },
  {
    title: 'Structured Cabling System (SCS)',
    text: [
      'Проектування структурованих кабельних систем', 
      'Встановлення та обслуговування SCS',
      'Системи контролю доступу',
      'Відеонагляд',
    ]
  },
  {
    title: 'Monitoring',
    text: [
      'Моніторинг продуктивності систем', 
      'Моніторинг мережевого трафіку',
      'Прогнозування виникнення проблем',
      'Аналітика використання ресурсів',
      'Моніторинг хмарних сервісів',
      'Моніторинг безпеки',
    ]
  },
  {
    title: 'Data',
    text: [
      'Проектування та впровадження серверної архітектури та СЗД', 
      'Адміністрування та управління серверами',
      'Усунення несправностей та підтримка',
    ]
  },
  {
    title: 'Audit',
    text: [
      'ІТ-аудит інфраструктури', 
      'Аудит безпеки',
    ]
  },
];

export const Accordion = () => {
  const [currentIndex, setCurrentIndex] = useState<number | null>(null)

  return (
    <>
      {sections.map((section, index) => (
        <AccordionItem 
          key={index} 
          section={section} 
          index={index}
          currentIndex={currentIndex}
          setCurrentIndex={setCurrentIndex}
          lastIndex={sections.length - 1}
        />
      ))}
    </>
  )
}